; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation14 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Planet15 image0)
	(have_image Planet16 image0)
	(have_image Phenomenon17 thermograph1)
	(have_image Star18 image0)
	(have_image Star19 thermograph2)
	(have_image Phenomenon20 image0)
	(have_image Star21 image0)
	(have_image Planet22 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (turn_to satellite1 phenomenon17 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 9
4. (turn_to satellite0 star19 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star19)
   goals met: 0 of 9
5. (turn_to satellite1 star3 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star3)
   goals met: 1 of 9
6. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 9
7. (turn_to satellite1 phenomenon17 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 9
8. (take_image satellite1 phenomenon17 instrument1 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 1 of 9
9. (turn_to satellite1 phenomenon20 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon20)
   goals met: 1 of 9
10. (take_image satellite1 phenomenon20 instrument1 image0)
   added: (have_image phenomenon20 image0)
   goals met: 2 of 9
11. (turn_to satellite1 planet15 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 planet15)
   goals met: 2 of 9
12. (take_image satellite1 planet15 instrument1 image0)
   added: (have_image planet15 image0)
   goals met: 3 of 9
13. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 3 of 9
14. (take_image satellite1 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 4 of 9
15. (turn_to satellite1 planet22 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet22)
   goals met: 4 of 9
16. (take_image satellite1 planet22 instrument1 image0)
   added: (have_image planet22 image0)
   goals met: 5 of 9
17. (turn_to satellite1 star18 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 star18)
   goals met: 5 of 9
18. (take_image satellite1 star18 instrument1 image0)
   added: (have_image star18 image0)
   goals met: 6 of 9
19. (turn_to satellite1 star21 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star21)
   goals met: 6 of 9
20. (take_image satellite1 star21 instrument1 image0)
   added: (have_image star21 image0)
   goals met: 7 of 9
21. (turn_to satellite1 star3 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star3)
   goals met: 8 of 9
22. (turn_to satellite0 star3 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star3)
   goals met: 8 of 9
23. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 8 of 9
24. (turn_to satellite0 star19 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star19)
   goals met: 8 of 9
25. (take_image satellite0 star19 instrument0 thermograph2)
   added: (have_image star19 thermograph2)
   goals met: 9 of 9
